Yourcomputermaster/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьАктов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Yourcomputermaster/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

Yourcomputermaster/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Yourcomputermaster/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Yourcomputermaster/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
Функция ВыполнитьЗаполнениеТЧФоново(ДатаНачала, ДатаОкончания) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ЕСТЬNULL(ОбработкаЗаказовОбороты.Регистратор, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбработкаЗаказов.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ОбработкаЗаказовОбороты
	               |		ПО ДоговорыКонтрагентов.Владелец = ОбработкаЗаказовОбороты.Контрагент
	               |			И (ОбработкаЗаказовОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг)
	               |			И (ОбработкаЗаказовОбороты.Период МЕЖДУ &ДатаНачала И &Датаокончания)
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.АбонентскаяПлата)
	               |	И ДоговорыКонтрагентов.ДействуетДо >= &ДатаНачала";
	Запрос.УстановитьПараметр("АбонентскаяПлата", Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбъектТЧ = Новый ТаблицаЗначений();
	ОбъектТЧ.Колонки.Добавить("Договор");
	ОбъектТЧ.Колонки.Добавить("Реализация");
	Количество = Выборка.Количество();
	Счетчик = 0;
		Пока Выборка.Следующий() Цикл
		
			Строка = ОбъектТЧ.Добавить();
			Строка.Договор = Выборка.Договор;
			Строка.Реализация = Выборка.Реализация;
			Счетчик = Счетчик + 1;
			ДлительныеОперации.СообщитьПрогресс(Счетчик / Количество * 100);
		КонецЦикла;
		
	Возврат ОбъектТЧ;
	
КонецФункции

Функция ВыполнитьЗаполнениеРеализацийФоново (ДатаНачала, ДатаОкончания) Экспорт
	
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	               |	ДоговорыКонтрагентов.Организация КАК Организация,
	               |	ДоговорыКонтрагентов.СуммаЕжемесячнойАбонентскойПлаты КАК СуммаЕжемесячнойАбонентскойПлаты,
	               |	ДоговорыКонтрагентов.ДействуетДо КАК ДействуетДо,
	               |	ОбработкаЗаказовОбороты.Заказ КАК Заказ,
	               |	ЕСТЬNULL(ОбработкаЗаказовОбороты.Регистратор, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбработкаЗаказов.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ОбработкаЗаказовОбороты
	               |		ПО ДоговорыКонтрагентов.Владелец = ОбработкаЗаказовОбороты.Контрагент
	               |			И (ОбработкаЗаказовОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг)
	               |			И ДоговорыКонтрагентов.Ссылка = ОбработкаЗаказовОбороты.Заказ
	               |			И (ОбработкаЗаказовОбороты.Период МЕЖДУ &ДатаНачала И &Датаокончания)
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.АбонентскаяПлата)
	               |	И ДоговорыКонтрагентов.ДействуетДо >= &ДатаНачала";
	Запрос.УстановитьПараметр("АбонентскаяПлата", АбонентскаяПлата);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбъектТЧ = Новый ТаблицаЗначений();
	ОбъектТЧ.Колонки.Добавить("Договор");
	ОбъектТЧ.Колонки.Добавить("Реализация");
	Количество = Выборка.Количество();
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
			Строка = ОбъектТЧ.Добавить();
			Строка.Договор = Выборка.Договор;
			Строка.Реализация = Выборка.Реализация;
			Продолжить;
		КонецЕсли;
		
		Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Документ.Контрагент = Выборка.Контрагент;
		Документ.Организация = Выборка.Организация;
		Документ.Договор = Выборка.Договор;
		Документ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Документ.Основание = Выборка.Договор;
		Документ.Дата = ДатаНачала;
		Документ.ВыполнитьАвтозаполнение(Истина);
		
		
		//Услуги = Документ.Услуги.Добавить();
		//Услуги.Номенклатура = АбонентскаяПлата;
		//Если Выборка.ДействуетДо < ДатаОкончания Тогда
		//	Услуги.Сумма = Выборка.СуммаЕжемесячнойАбонентскойПлаты / День(ДатаОкончания) * День(Выборка.ДействуетДо);
		//Иначе
		//	Услуги.Сумма = Выборка.СуммаЕжемесячнойАбонентскойПлаты;
		//КонецЕсли;
		Документ.ПроверитьЗаполнение();
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
		Строка = ОбъектТЧ.Добавить();
		Строка.Договор = Выборка.Договор;
		Строка.Реализация = Документ.Ссылка;
		Счетчик = Счетчик + 1;
		ДлительныеОперации.СообщитьПрогресс(Счетчик / Количество * 100);
	КонецЦикла;
	
	Возврат ОбъектТЧ;
	
КонецФункции
#КонецОбласти
#КонецЕсли
